app/views/users/_animal.html.erb

SELECT "animals".* FROM "animals" WHERE "animals"."user_id" = $1  [["user_id", 1]]
---
 <h5><%= link_to Animal.where(), animal_path%></h5>