app/views/animals/_comment.html.erb

<div>
  <h5>Comment by <%=User.find(comment.user_id).name%></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]