app/controllers/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"

  def show
    @animal = Animal.find(params[:id])
    @user = User.find(@animal.user_id)
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @animal = Animal.new animal_params
    @animal.user_id = current_user.id
    @animal.save
---
INSERT INTO "animals" ("animal_name", "kind", "age", "story", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["animal_name", ",m "], ["kind", "knj"], ["age", 5], ["story", "lkjblkj"], ["user_id", 5], ["created_at", "2015-11-08 23:36:53.380837"], ["updated_at", "2015-11-08 23:36:53.380837"]]

  def edit
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @animal = Animal.find(params[:id])
    @animal.update(animal_params)
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "animals" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "animals"."id" = $6

  def destroy
    @animal = Animal.find(params[:id])
    @animal.destroy
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 4]]