app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "body", "animal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 0], ["body", "kadnv;kdfvfd"], ["animal_id", 1], ["created_at", "2015-11-08 18:09:39.623178"], ["updated_at", "2015-11-08 18:09:39.623178"]]
---
  def create
    @comment = Comment.new comment_params
    @comment.animal_id = params[:animal_id]
    @comment.user_id = current_user.id
    @comment.save