app/controllers/users_controller.rb

def show
  if logged_in?

    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

def create
  @user = User.new user_params
  if @user.save
---
INSERT INTO "users" ("name", "phone", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

def destroy
  @user = User.find params[:id]
  @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]